print("============================================")
print("         ЛАБОРАТОРНА РОБОТА №1")
print("     ПРОГРАМУВАННЯ ЛІНІЙНИХ АЛГОРИТМІВ")
print("    АВТОР: КАСІЧ БОГДАН , КМ-83 (6 ВАРІАНТ)")
print("============================================")
print(" Доброго Дня! Дана програма переводить градуси Цельсія у градуси Фаренгейта")
degrees_Celsius=int(input("Введіть бажані градуси Цельсія:"))
degrees_Fahrenheit=degrees_Celsius*1.8 + 32
print("Градуси Фаренгейта:", degrees_Fahrenheit)

input("Дякуємо за використання. Натисніть Enter для завершення програми")

