print("============================================")
print("           ЛАБОРАТОРНА РОБОТА №1")
print("     ПРОГРАМУВАННЯ РОЗГАЛУЖЕНИХ ПРОЦЕСІВ")
print("   АВТОР: КАСІЧ БОГДАН, КМ-83 (6 ВАРІАНТ)")
print("============================================")
print(" Добрий день! Дана програма покаже яке з двух введених вами цілих чисел більше та перетворить менше число у нього")
print(" Якщо вони однакові , то програма перетворить їх у нулі")

a=int(input("Введіть перше число:"))
b=int(input("Введіть друге число:"))
if a!=b and a > b:
    b=a 
    print("Перше число=", a)
    print("Друге число(тепер)=", b)
elif a!=b and b > a:
    a=b
    print("Перше число(тепер)=", a)
    print("Друге число=", b)
else:
    a=0
    b=0
    print("Перше число(тепер)=", a)
    print("Друге число(тепер)=", b)

input("Дякуємо за використання. Натисніть Enter для завершення програмы")
