print("============================================")
print("           ЛАБОРАТОРНА РОБОТА №1")
print("     ПРОГРАМУВАННЯ РОЗГАЛУЖЕНИХ ПРОЦЕСІВ")
print("   АВТОР: КАСІЧ БОГДАН, КМ-83 (6 ВАРІАНТ)")
print("============================================")
print(" Добрый День! Дана програма знаходить значення функціі F(x)")
print(" Якщо х > 7 , то F(x)= (x**2-4)**(-1)")
print(" Якщо x <= 7 , то F(x)= 3*x - 9")

x=float(input("Введіть значення х:"))
if x > 7:
    print(((x**2)-4)**(-1))
else:
    print(3*x-9)


input("Дякуємо за використання. Натисніть Enter для завершення програмы")
